//По двум заданным числам проверять является ли первое квадратом второго
// DZ_01
//По заданному номеру дня недели вывести его название
// DZ_02
//Выяснить является ли число чётным
// DZ_03
int Num1;
int Num2;
Console.Write("Введите число, а мы определим четное ли оно : ");
Num1 = int.Parse(Console.ReadLine());
Num2 = Num1 /2;
if (Num1 == Num2*2) Console.WriteLine("Число "+ Num1 +" Четное "); 
else Console.WriteLine("Число "+ Num1 +" Нечетное ");

//Показать четные числа от 1 до N
// DZ_04
//Показать последнюю цифру трёхзначного числа
// DZ_05
//Показать вторую цифру трёхзначного числа
// DZ_06
//Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
// DZ_07
//Удалить вторую цифру трёхзначного числа
// DZ_08
//Выяснить, кратно ли число заданному, если нет, вывести остаток.
// DZ_09
//Найти третью цифру числа или сообщить, что её нет
// DZ_10